<template>
  <swiper
    :modules="[Navigation, Pagination]"
    navigation
    :pagination="{
      clickable: true,
      dynamicBullets: true,
    }"
    :slides-per-view="4"
    :space-between="10"
    class="w-full h-auto"
  >
    <swiper-slide
      v-for="(item, index) in cours"
      :key="index"
      class="bg-white rounded-lg shadow-md border"
    >
      <div class="w-full h-52 mb-10">
        <img :src="item.img" alt="coursImg" class="w-full h-full object-cover rounded-lg" />
      </div>

      <div class="p-3 flex flex-col gap-5">
        <h3 class="heading text-center !text-2xl">{{ item.title }}</h3>
        <p class="appText text-center !font-bold">{{ item.date }}</p>
        <p class="appText h-32 overflow-hidden">
          {{ item.about }}
        </p>
        <div class="flex justify-between">
          <buttonV>&#9733;</buttonV>
          <buttonV>Подробнее...</buttonV>
        </div>
      </div>
    </swiper-slide>
  </swiper>
</template>

<script>
import { Swiper, SwiperSlide } from 'swiper/vue'
import { Navigation, Pagination } from 'swiper/modules'

// Swiper стили
import 'swiper/css'
import 'swiper/css/navigation'
import 'swiper/css/pagination'

export default {
  components: {
    Swiper,
    SwiperSlide,
  },
  data() {
    return {
      cours: [
        {
          id: 1,
          title: 'информатика изучение о области окружности.',
          date: 'Авг 08. 2024 до Сен 8. 2025',
          img: '/images/ImgnotFound.jpg',
          about: `Текст о курсе должен быть структурированным, понятным и сфокусированным на ценности для обучающегося. Он должен включать информацию о том, что студент получит в результате (например, конкретный план по снижению долга или понимание своего стиля), а также описывать содержание курса, включая материалы, задания и цели. Для создания эффективного текста используйте простые предложения, избегайте "стоп-слов" и используйте глаголы действия для привлечения внимания`,
        },
        {
          id: 1,
          title: 'информатика изучение о области окружности.',
          date: 'Авг 08. 2024 до Сен 8. 2025',
          img: '/images/ImgnotFound.jpg',
          about: `Текст о курсе должен быть структурированным, понятным и сфокусированным на ценности для обучающегося. Он должен включать информацию о том, что студент получит в результате (например, конкретный план по снижению долга или понимание своего стиля), а также описывать содержание курса, включая материалы, задания и цели. Для создания эффективного текста используйте простые предложения, избегайте "стоп-слов" и используйте глаголы действия для привлечения внимания`,
        },
        {
          id: 1,
          title: 'информатика изучение о области окружности.',
          date: 'Авг 08. 2024 до Сен 8. 2025',
          img: '/images/ImgnotFound.jpg',
          about: `Текст о курсе должен быть структурированным, понятным и сфокусированным на ценности для обучающегося. Он должен включать информацию о том, что студент получит в результате (например, конкретный план по снижению долга или понимание своего стиля), а также описывать содержание курса, включая материалы, задания и цели. Для создания эффективного текста используйте простые предложения, избегайте "стоп-слов" и используйте глаголы действия для привлечения внимания`,
        },
        {
          id: 1,
          title: 'информатика изучение о области окружности.',
          date: 'Авг 08. 2024 до Сен 8. 2025',
          img: '/images/ImgnotFound.jpg',
          about: `Текст о курсе должен быть структурированным, понятным и сфокусированным на ценности для обучающегося. Он должен включать информацию о том, что студент получит в результате (например, конкретный план по снижению долга или понимание своего стиля), а также описывать содержание курса, включая материалы, задания и цели. Для создания эффективного текста используйте простые предложения, избегайте "стоп-слов" и используйте глаголы действия для привлечения внимания`,
        },
               {
          id: 1,
          title: 'информатика изучение о области окружности.',
          date: 'Авг 08. 2024 до Сен 8. 2025',
          img: '/images/ImgnotFound.jpg',
          about: `Текст о курсе должен быть структурированным, понятным и сфокусированным на ценности для обучающегося. Он должен включать информацию о том, что студент получит в результате (например, конкретный план по снижению долга или понимание своего стиля), а также описывать содержание курса, включая материалы, задания и цели. Для создания эффективного текста используйте простые предложения, избегайте "стоп-слов" и используйте глаголы действия для привлечения внимания`,
        },
               {
          id: 1,
          title: 'информатика изучение о области окружности.',
          date: 'Авг 08. 2024 до Сен 8. 2025',
          img: '/images/ImgnotFound.jpg',
          about: `Текст о курсе должен быть структурированным, понятным и сфокусированным на ценности для обучающегося. Он должен включать информацию о том, что студент получит в результате (например, конкретный план по снижению долга или понимание своего стиля), а также описывать содержание курса, включая материалы, задания и цели. Для создания эффективного текста используйте простые предложения, избегайте "стоп-слов" и используйте глаголы действия для привлечения внимания`,
        },
      ],
    }
  },
  setup() {
    return {
      Navigation,
      Pagination,
    }
  },
}
</script>

<style scoped>
:deep(.swiper-button-next),
:deep(.swiper-button-prev) {
  width: 1rem !important;
  height: 2rem !important;
  color: #336799 !important;
}
</style>
